Revit 2027 API
RebarContainerItem.MultiplanarDepth Property
 For a multiplanar rebar, the depth of the instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MultiplanarDepth { get; set; }
Public Property MultiplanarDepth As Double
	Get
	Set
public:
property double MultiplanarDepth {
	double get ();
	void set (double value);
}
member MultiplanarDepth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: multiplanarDepth must be positive.
InvalidOperationException |  This RebarContainerItem is not an instance of a multiplanar shape.
Remarks
 Applicable only when an instance of a RebarShape with a RebarShapeMultiplanarDefinition.
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace